Перем ирПортативный Экспорт;
Перем ирОбщий Экспорт;
Перем ирСервер Экспорт;
Перем ирКэш Экспорт;
Перем ирПривилегированный Экспорт;

Перем мПараметрКлючИлиОбъект Экспорт;
Перем мПараметрПрочитатьОбъект Экспорт;
Перем мПараметрИскомоеЗначение Экспорт;

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>;
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>.
//
Процедура РедактироватьОбъектСсылки(КлючОбъекта, пИскомоеЗначение = Неопределено, КлючУникальности = Неопределено) Экспорт 

	ПолучитьФормуСсылки(КлючОбъекта, пИскомоеЗначение, КлючУникальности).Открыть();

КонецПроцедуры 

Процедура РедактироватьМодифицированныйОбъект(ОбъектБД, пИскомоеЗначение = Неопределено, КлючУникальности = Неопределено) Экспорт 

	Форма = ПолучитьФорму(,, КлючУникальности);
	ЭтотОбъект.мПараметрКлючИлиОбъект = ОбъектБД;
	ЭтотОбъект.мПараметрПрочитатьОбъект = Ложь;
	ЭтотОбъект.мПараметрИскомоеЗначение = пИскомоеЗначение;
	Форма.Открыть();

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>;
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>.
//
Функция ПолучитьФормуСсылки(КлючОбъекта, пИскомоеЗначение = Неопределено, КлючУникальности = Неопределено) Экспорт 

	Форма = ПолучитьФорму(,, КлючУникальности);
	ЭтотОбъект.мПараметрКлючИлиОбъект = КлючОбъекта;
	ЭтотОбъект.мПараметрПрочитатьОбъект = Истина;
	ЭтотОбъект.мПараметрИскомоеЗначение = пИскомоеЗначение;
	Возврат Форма;

КонецФункции 

#Если Клиент Тогда
Контейнер = Новый Структура();
Оповестить("ирПолучитьБазовуюФорму", Контейнер);
Если Не Контейнер.Свойство("ирПортативный", ирПортативный) Тогда
	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
	ирПортативный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
КонецЕсли; 
ирОбщий = ирПортативный.ПолучитьОбщийМодульЛкс("ирОбщий");
ирКэш = ирПортативный.ПолучитьОбщийМодульЛкс("ирКэш");
ирСервер = ирПортативный.ПолучитьОбщийМодульЛкс("ирСервер");
ирПривилегированный = ирПортативный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
#КонецЕсли

мПараметрПрочитатьОбъект = Истина;