Перем ирПортативный Экспорт;
Перем ирОбщий Экспорт;
Перем ирСервер Экспорт;
Перем ирКэш Экспорт;
Перем ирПривилегированный Экспорт;

Процедура ДеревоОтчетовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	РодительСтроки = ВыбраннаяСтрока;
	Пока РодительСтроки <> НеОпределено Цикл

		Если РодительСтроки = ТекущаяСтрокаВладельца Тогда
			Предупреждение("Нельзя выбирать в качестве копируемой строки саму строку
			               |или подчиненные ей строки. Выберите другую строку.");
			Возврат;
		КонецЕсли;

		РодительСтроки = РодительСтроки.Родитель;

	КонецЦикла;

	ОповеститьОВыборе(ЭлементыФормы.ДеревоОтчетов.ТекущаяСтрока);

КонецПроцедуры

Процедура КнопкаНаВерхнийУровеньНажатие(Элемент)

	ОповеститьОВыборе(ВладелецФормы.ДеревоОтчетов);

КонецПроцедуры

#Если Клиент Тогда
Контейнер = Новый Структура();
Оповестить("ирПолучитьБазовуюФорму", Контейнер);
Если Не Контейнер.Свойство("ирПортативный", ирПортативный) Тогда
	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
	ирПортативный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
КонецЕсли; 
ирОбщий = ирПортативный.ПолучитьОбщийМодульЛкс("ирОбщий");
ирКэш = ирПортативный.ПолучитьОбщийМодульЛкс("ирКэш");
ирСервер = ирПортативный.ПолучитьОбщийМодульЛкс("ирСервер");
ирПривилегированный = ирПортативный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
#КонецЕсли

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Отчет.ирКонсольКомпоновокДанных.Форма.ФормаВыбораСтрокиДереваОтчетов");



