Перем ирПортативный Экспорт;
Перем ирОбщий Экспорт;
Перем ирСервер Экспорт;
Перем ирКэш Экспорт;
Перем ирПривилегированный Экспорт;

Процедура КнопкаОКНажатие(Кнопка)
	
	ирКэш.Получить().СинтаксическийКонтрольПередЗаписью = СинтаксическийКонтрольПередЗаписью;
	ирКэш.Получить().ВыполнятьАлгоритмыЧерезВнешниеОбработки = ВыполнятьАлгоритмыЧерезВнешниеОбработки;
	ирКэш.Получить().ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов = ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов;
	ирКэш.Получить().ФиксироватьВнешниеИсключенияАлгоритмов = ФиксироватьВнешниеИсключенияАлгоритмов;
	ирКэш.Получить().ФайловыйКэшАлгоритмовДопускаетРедактирование = ФайловыйКэшАлгоритмовДопускаетРедактирование;
	ирКэш.Получить().ПроверитьСтруктуруФайловогоКэша();
	ирКэш.Получить().СохранитьНастройкиАлгоритмов();
	Закрыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	КаталогДинамическихВнешнихОбработок = ирКэш.Получить().ПапкаКешаВнешнихОбработокАлгоритмов.ПолноеИмя;
	ФайловыйКэшАлгоритмовДопускаетРедактирование = ирКэш.Получить().ФайловыйКэшАлгоритмовДопускаетРедактирование;
	СинтаксическийКонтрольПередЗаписью = ирКэш.Получить().СинтаксическийКонтрольПередЗаписью;
	ВыполнятьАлгоритмыЧерезВнешниеОбработки = ирКэш.Получить().ВыполнятьАлгоритмыЧерезВнешниеОбработки;
	ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов = ирКэш.Получить().ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов;
	ФиксироватьВнешниеИсключенияАлгоритмов = ирКэш.Получить().ФиксироватьВнешниеИсключенияАлгоритмов;
	ФиксироватьВнешниеИсключенияАлгоритмовПриИзменении(ЭлементыФормы.ФиксироватьВнешниеИсключенияАлгоритмов);
	
	Если ирКэш.Получить().Это2iS Тогда
		ЭлементыФормы.ВыполнятьАлгоритмыЧерезВнешниеОбработки.Доступность = Ложь;
		ЭлементыФормы.ФиксироватьВнешниеИсключенияАлгоритмов.Доступность = Ложь;
		ЭлементыФормы.СинтаксическийКонтрольПередЗаписью.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура КаталогДинамическихВнешнихОбработокОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Элемент.Значение);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОчиститьНажатие(Элемент)
	
	ирКэш.Получить().ОчиститьКешАлгоритмов(Истина);
	
КонецПроцедуры

Процедура ФиксироватьВнешниеИсключенияАлгоритмовПриИзменении(Элемент)
	
	ЭлементыФормы.ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов.Доступность = Элемент.Значение;
	
КонецПроцедуры

Процедура ВыполнятьАлгоритмыЧерезВнешниеОбработкиПриИзменении(Элемент)

	ЭлементыФормы.ФайловыйКэшАлгоритмовДопускаетРедактирование.Доступность = Элемент.Значение;
	
КонецПроцедуры

#Если Клиент Тогда
Контейнер = Новый Структура();
Оповестить("ирПолучитьБазовуюФорму", Контейнер);
Если Не Контейнер.Свойство("ирПортативный", ирПортативный) Тогда
	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
	ирПортативный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
КонецЕсли; 
ирОбщий = ирПортативный.ПолучитьОбщийМодульЛкс("ирОбщий");
ирКэш = ирПортативный.ПолучитьОбщийМодульЛкс("ирКэш");
ирСервер = ирПортативный.ПолучитьОбщийМодульЛкс("ирСервер");
ирПривилегированный = ирПортативный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
#КонецЕсли

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.НастройкиАлгоритмов");
