Перем ирПортативный Экспорт;
Перем ирОбщий Экспорт;
Перем ирСервер Экспорт;
Перем ирКэш Экспорт;
Перем ирПривилегированный Экспорт;

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Попытка
		НовоеЗначение = Новый УникальныйИдентификатор(УникальныйИдентификатор);
	Исключение
		Сообщить("Неверная строка идентификатора!", СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки; 
	ирОбщий.ПрименитьИзмененияИЗакрытьФормуЛкс(ЭтаФорма, НовоеЗначение);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ТипЗнч(НачальноеЗначениеВыбора) <> Тип("УникальныйИдентификатор") Тогда
		НачальноеЗначениеВыбора = Новый УникальныйИдентификатор();
	КонецЕсли; 
	УникальныйИдентификатор = "" + НачальноеЗначениеВыбора;

КонецПроцедуры

Процедура ИзПредставленияНенайденногоОбъектаОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	лУникальныйИдентификатор = ирКэш.Получить().ПолучитьУникальныйИдентификаторИзСтроки(Текст);
	Если лУникальныйИдентификатор <> Неопределено Тогда
		УникальныйИдентификатор = лУникальныйИдентификатор;
		ЭтаФорма.Модифицированность = Истина;
		Элемент.ЦветФонаПоля = WebЦвета.СветлоЗеленый;
	Иначе
		Элемент.ЦветФонаПоля = WebЦвета.СветлоРозовый;
	КонецЕсли;

КонецПроцедуры

Процедура ОсновныеДействияФормыСгенерировать(Кнопка)
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
КонецПроцедуры

#Если Клиент Тогда
Контейнер = Новый Структура();
Оповестить("ирПолучитьБазовуюФорму", Контейнер);
Если Не Контейнер.Свойство("ирПортативный", ирПортативный) Тогда
	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
	ирПортативный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
КонецЕсли; 
ирОбщий = ирПортативный.ПолучитьОбщийМодульЛкс("ирОбщий");
ирКэш = ирПортативный.ПолучитьОбщийМодульЛкс("ирКэш");
ирСервер = ирПортативный.ПолучитьОбщийМодульЛкс("ирСервер");
ирПривилегированный = ирПортативный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
#КонецЕсли

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.УникальныйИдентификатор");
